In [4]:
import numpy
import numpy as np
import time
import datetime
import netCDF4
import matplotlib.pylab as plt
import os,sys,glob
from multiprocessing import Pool
#import odb
from eccodes import *
from functools import partial
from collections import OrderedDict
import subprocess
import json
import gzip
import copy
import pickle
import xarray as xr
import pickle
import pandas as pd
import matplotlib
import matplotlib.pylab as plt
import matplotlib.pyplot as maplt
matplotlib.rcParams.update({'font.size': 20})

plt.rcParams['lines.linewidth'] = 3

import warnings
warnings.filterwarnings('ignore')

sys.path.append(os.getcwd()+'/../cds-backend/code/')
import cds_eua4 as eua
import trajectory as trj

import h5py
import ray
import pyproj
# ray.init(num_cpus=7)

Warning: ecCodes 2.21.0 or higher is recommended. You are running version 2.17.0

In [5]:

def find_nearest(array, value):
    array = np.asarray(array)
    idx = (np.abs(array - value)).argmin()
    return array[idx]

def datetime_to_seconds(dates, ref='1900-01-01T00:00:00'):
    """ from datetime64 to seconds since 1900-01-01 00:00:00"""
    return ((dates - np.datetime64(ref)) / np.timedelta64(1, 's')).astype(np.int64)

def seconds_to_datetime(seconds, ref='1900-01-01'):
    """ from seconds to datetime64 """
    seconds = np.asarray(seconds)
    return pd.to_datetime(seconds, unit='s', origin=ref)

In [6]:
def get_cuon(stat, year_s, year_e):
    # stat = '11035'
    # year = '2000'
    dt_from = datetime_to_seconds(np.datetime64(str(year_s)+'-01-01'))
    dt_to = datetime_to_seconds(np.datetime64(str(year_e)+'-12-31'))

    conv_file = glob.glob('/mnt/users/scratch/leo/scratch/converted_v10/*' + stat + '*_CEUAS_merged_v1.nc')[0]
    # conv_file = glob.glob('./0-20001-0-11035_CEUAS_merged_v1.nc')[0]

    df_dict = {}
    u_df_dict = {}
    v_df_dict = {}

    stdplevs = [1000,2000,3000,5000,7000,10000,15000,20000,25000,30000,40000,50000,70000,85000,92500]


    with h5py.File(conv_file, 'r') as file:
        rts = file['recordindices']['recordtimestamp'][:]
        idx = np.where(np.logical_and((rts >= dt_from), (rts <= dt_to)))[0]
        if len(idx) == 0:
            print('(1) NO DATA FOUND IN CONVERTED_V9: ', sid)
        u_idx = file['recordindices']['139'][idx]
        v_idx = file['recordindices']['140'][idx]
        t_idx = file['recordindices']['126'][idx]
        
#         plevs = [1000,2000,3000,5000,7000,10000,15000,20000,25000,30000,40000,50000,70000,85000,92500,100000]
        
#         mask = file['observations_table']['z_coordinate'][t_idx[0]:t_idx[-1]]
#         mask = np.isin(mask,plevs)

#         u_mask = file['observations_table']['z_coordinate'][u_idx[0]:u_idx[-1]]
#         u_mask = np.isin(u_mask,plevs)

#         v_mask = file['observations_table']['z_coordinate'][v_idx[0]:v_idx[-1]]
#         v_mask = np.isin(v_mask,plevs)
        mask = len(file['observations_table']['z_coordinate'][t_idx[0]:t_idx[-1]])*[True]
        u_mask = len(file['observations_table']['z_coordinate'][u_idx[0]:u_idx[-1]])*[True]
        v_mask = len(file['observations_table']['z_coordinate'][v_idx[0]:v_idx[-1]])*[True]

        # t_len = len(mask[mask == True])
        # u_len = len(u_mask[u_mask == True])
        # v_len = len(v_mask[v_mask == True])
        
        t_len = len(mask)
        u_len = len(u_mask)
        v_len = len(v_mask)

        df_dict['z_coordinate'] = list(file['observations_table']['z_coordinate'][t_idx[0]:t_idx[-1]][mask])
        df_dict['date_time'] = list(file['observations_table']['date_time'][t_idx[0]:t_idx[-1]][mask])
        df_dict['observation_value'] = list(file['observations_table']['observation_value'][t_idx[0]:t_idx[-1]][mask])
        df_dict['latitude'] = list(file['observations_table']['latitude'][t_idx[0]:t_idx[-1]][mask])
        df_dict['longitude'] = list(file['observations_table']['longitude'][t_idx[0]:t_idx[-1]][mask])
        repid = np.asarray(file['observations_table']['report_id'][t_idx[0]:t_idx[-1]][mask])
        df_dict['report_id'] = list(repid.view('|S{}'.format(repid.shape[1])).flatten().astype(str))

        # df_dict['RASE_bias_estimate'] = list(file['advanced_homogenisation']['RASE_bias_estimate'][t_idx[0]:t_idx[-1]][mask])
        df_dict['fg_depar'] = list(file['era5fb']['fg_depar@body'][t_idx[0]:t_idx[-1]][mask])
        df_dict['an_depar'] = list(file['era5fb']['an_depar@body'][t_idx[0]:t_idx[-1]][mask])
        df_dict['biascorr'] = list(file['era5fb']['biascorr@body'][t_idx[0]:t_idx[-1]][mask])
        # df_dict['latitude_displacement'] = list(file['advanced_homogenisation']['latitude_displacement'][t_idx[0]:t_idx[-1]][mask])
        # df_dict['longitude_displacement'] = list(file['advanced_homogenisation']['longitude_displacement'][t_idx[0]:t_idx[-1]][mask])
        # df_dict['time_since_launch'] = list(file['advanced_homogenisation']['time_since_launch'][t_idx[0]:t_idx[-1]][mask])

        u_df_dict['z_coordinate'] = list(file['observations_table']['z_coordinate'][u_idx[0]:u_idx[-1]][u_mask])
        u_df_dict['date_time'] = list(file['observations_table']['date_time'][u_idx[0]:u_idx[-1]][u_mask])
        u_df_dict['observation_value'] = list(file['observations_table']['observation_value'][u_idx[0]:u_idx[-1]][u_mask])

        v_df_dict['z_coordinate'] = list(file['observations_table']['z_coordinate'][v_idx[0]:v_idx[-1]][v_mask])
        v_df_dict['date_time'] = list(file['observations_table']['date_time'][v_idx[0]:v_idx[-1]][v_mask])
        v_df_dict['observation_value'] = list(file['observations_table']['observation_value'][v_idx[0]:v_idx[-1]][v_mask])


        # df_dict['observation_value'] = ['air_temperature']*t_len
        # u_df_dict['observation_value'] = ['eastward_wind']*u_len
        # v_df_dict['observation_value'] = ['northward_wind']*v_len

        df_dict['date_time'] = seconds_to_datetime(df_dict['date_time'])
        df = pd.DataFrame.from_dict(df_dict)
        df = df.rename(columns={'observation_value':'air_temperature'})

        u_df_dict['date_time'] = seconds_to_datetime(u_df_dict['date_time'])
        u_df = pd.DataFrame.from_dict(u_df_dict)
        u_df = u_df.rename(columns={'observation_value':'eastward_wind_speed'})

        v_df_dict['date_time'] = seconds_to_datetime(v_df_dict['date_time'])
        v_df = pd.DataFrame.from_dict(v_df_dict)
        v_df = v_df.rename(columns={'observation_value':'northward_wind_speed'})

        # put dfs together:
        df = df.merge(u_df, how='inner', on=['date_time','z_coordinate'])
        df = df.merge(v_df, how='inner', on=['date_time','z_coordinate'])
    #         print(df)
    return df

In [7]:
df = get_cuon('11035', '1980', '1993')

In [8]:
df

,z_coordinate,date_time,air_temperature,latitude,longitude,report_id,fg_depar,an_depar,biascorr,eastward_wind_speed,northward_wind_speed
0,3300.0,1980-01-01 00:00:00,205.699997,48.25,16.370001,100000000044957,2.663347,1.328656,-0.841882,27.574617,-4.862149
1,5000.0,1980-01-01 00:00:00,206.899994,48.25,16.370001,100000000044957,-0.888495,-0.555904,-0.068680,21.612930,-7.866463
2,5800.0,1980-01-01 00:00:00,206.300003,48.25,16.370001,100000000044957,-2.256762,-2.002759,-0.151446,17.726540,-3.125667
3,7000.0,1980-01-01 00:00:00,210.100006,48.25,16.370001,100000000044957,0.230430,0.207024,-0.256313,17.726540,-3.125667
4,10000.0,1980-01-01 00:00:00,212.500000,48.25,16.370001,100000000044957,-0.684438,-0.329867,-0.485842,16.741732,-2.952019
...,...,...,...,...,...,...,...,...,...,...,...
176368,85000.0,1993-12-30 12:00:00,272.500000,48.25,16.370001,100000000065624,-0.663564,-0.230999,0.307848,11.604740,-6.700000
176369,85900.0,1993-12-30 12:00:00,273.100006,48.25,16.370001,100000000065624,-0.484588,-0.174735,0.269503,11.604740,-6.700000
176370,92500.0,1993-12-30 12:00:00,276.000000,48.25,16.370001,100000000065624,0.112498,0.411676,0.000000,13.909332,-3.726994
176371,97200.0,1993-12-30 12:00:00,270.500000,48.25,16.370001,100000000065624,-5.890202,-4.865841,0.000000,7.705480,2.804565
176372,99600.0,1993-12-30 12:00:00,272.100006,48.25,16.370001,100000000065624,NaN,NaN,NaN,-0.766044,0.642788

In [14]:
conv_file = '/mnt/users/scratch/leo/scratch/converted_v9/newindex/0-20001-0-11035_CEUAS_merged_v1.nc'
#conv_file = '/mnt/users/scratch/leo/scratch/converted_v10/0-20001-0-11035_CEUAS_merged_v1.nc'

results = {}
results['group'] = []
results['variable'] = []
results['len'] = []
results['allnan'] = []
results['allequ'] = []
results['value_if_all_same'] = []


with h5py.File(conv_file, 'r') as file:
    print(file['station_configuration'])
    print(file['station_configuration'].keys())
    print(file['station_configuration']['primary_id'][:])
    print(np.unique(file['station_configuration']['primary_id'][:]))
    
#     for i in file.keys():
#         print(i)
#         print('    ',file[i])
#         do_vars = True
#         try:
#             for j in file[i].keys():
#                 x = 0
#         except:
#             do_vars = False
#         if do_vars:
#             for j in file[i].keys():
#                 print('        ',j)
#                 print('            ',file[i][j])
#                 print('            ',file[i][j][-10:])
#                 try:
#                     allnan = np.all(np.isnan(file[i][j][:]))
#                 except:
#                     allnan = False
#                 print('            ', allnan)
#                 allequ = np.all(file[i][j][:] == file[i][j][-1])
#                 print('            ', allequ)
                
#                 if allnan:
#                     results['value_if_all_same'].append('nan')
#                 elif allequ:
#                     results['value_if_all_same'].append(str(file[i][j][-1]))
#                 else:
#                     results['value_if_all_same'].append('')
#                 results['len'].append(np.shape(file[i][j][:]))
#                 results['group'].append(i)
#                 results['variable'].append(j)
#                 results['allnan'].append(allnan)
#                 results['allequ'].append(allequ)
#         print()
# rdf_old = pd.DataFrame.from_dict(results)
# display(rdf)
# display(rdf_old)

<HDF5 group "/station_configuration" (46 members)>
<KeysViewHDF5 ['alternative_name', 'bbox_max_latitude', 'bbox_max_longitude', 'bbox_min_latitude', 'bbox_min_longitude', 'city', 'comment', 'contact', 'end_date', 'index', 'latitude', 'local_gravity', 'longitude', 'measuring_system_id', 'measuring_system_model', 'metadata_contact', 'metadata_contact_role', 'observed_variables', 'observing_frequency', 'operating_institute', 'operating_territory', 'optional_data', 'platform_sub_type', 'platform_type', 'primary_id', 'primary_id_scheme', 'reporting_time', 'role', 'secondary_id', 'secondary_id_scheme', 'start_date', 'station_abbreviation', 'station_automation', 'station_crs', 'station_name', 'station_type', 'string12', 'string15', 'string21', 'string22', 'string25', 'string3', 'string32', 'string34', 'string83', 'telecommunication_method']>
[[b'0' b'-' b'2' b'0' b'0' b'0' b'1' b'-' b'0' b'-' b'1' b'1' b'0' b'3'
  b'5']]
[b'-' b'0' b'1' b'2' b'3' b'5']

In [24]:
rdf_old.to_csv('station_check_old.csv')

In [39]:
rdf_old.

,group,variable,len,allnan,allequ,value_if_all_same
0,advanced_homogenisation,RAOBCORE_bias_estimate,"(88072698,)",False,False,
1,advanced_homogenisation,RASE_bias_estimate,"(88072698,)",False,False,
2,advanced_homogenisation,RICH_bias_estimate,"(88072698,)",False,False,
3,advanced_homogenisation,RISE_bias_estimate,"(88072698,)",False,False,
4,advanced_homogenisation,humidity_bias_estimate,"(88072698,)",False,False,
...,...,...,...,...,...,...
300,units,units_len,"(154,)",False,True,0.0
301,z_coordinate_type,description,"(2, 80)",False,False,
302,z_coordinate_type,string80,"(80,)",False,True,0.0
303,z_coordinate_type,type,"(2,)",False,False,
304,z_coordinate_type,z_coordinate_type_len,"(2,)",False,True,0.0

In [46]:
rdf['path'] = np.array(rdf.group +'/'+ rdf.variable)

In [47]:
rdf_old['path'] = np.array(rdf_old.group +'/'+ rdf_old.variable)

In [56]:
rdf_comp = rdf[np.isin(rdf.path, rdf_old.path)]
rdf_comp['old_value_if_all_same'] = np.array(rdf_old[np.isin(rdf_old.path, rdf.path)].value_if_all_same)
rdf_comp

,group,variable,len,allnan,allequ,value_if_all_same,path,old_value_if_all_same
0,crs,crs,"(1,)",False,True,0,crs/crs,0
1,crs,crs_len,"(1,)",False,True,0.0,crs/crs_len,0.0
2,crs,description,"(1, 80)",False,True,[b'w' b'g' b's' b'8' b'4' b'' b'' b'' b'' b'' ...,crs/description,[b'w' b'g' b's' b'8' b'4' b'' b'' b'' b'' b'' ...
3,crs,string80,"(80,)",False,True,0.0,crs/string80,0.0
4,era5fb,albedo@modsurf,"(115828893,)",False,False,,era5fb/albedo@modsurf,
...,...,...,...,...,...,...,...,...
282,units,units_len,"(154,)",False,True,0.0,units/units_len,0.0
283,z_coordinate_type,description,"(2, 80)",False,False,,z_coordinate_type/description,
284,z_coordinate_type,string80,"(80,)",False,True,0.0,z_coordinate_type/string80,0.0
285,z_coordinate_type,type,"(2,)",False,False,,z_coordinate_type/type,
286,z_coordinate_type,z_coordinate_type_len,"(2,)",False,True,0.0,z_coordinate_type/z_coordinate_type_len,0.0

In [60]:
test_df = rdf_comp[rdf_comp.value_if_all_same != rdf_comp.old_value_if_all_same]

In [63]:
test_df.loc[249].old_value_if_all_same

"[b'1' b'9' b'1' b'0' b'0' b'1' b'0' b'6' b'' b'' b'' b'' b'' b'' b'' b''\n b'' b'' b'' b'' b'']"

In [57]:
rdf_comp.to_csv('comparison_csv_nc_check.csv')

In [64]:
rdf[~np.isin(rdf.path, rdf_old.path)]

,group,variable,len,allnan,allequ,value_if_all_same,path
127,header_table,string21,"(20,)",False,True,b'',header_table/string21
174,observations_table,string21,"(20,)",False,True,b'',observations_table/string21
255,station_configuration,string1,"(1,)",False,True,b'',station_configuration/string1
262,station_configuration,string4,"(4,)",False,True,b'',station_configuration/string4
263,station_configuration,string8,"(8,)",False,True,b'',station_configuration/string8

In [65]:
rdf_old[~np.isin(rdf_old.path, rdf.path)]

,group,variable,len,allnan,allequ,value_if_all_same,path
0,advanced_homogenisation,RAOBCORE_bias_estimate,"(88072698,)",False,False,,advanced_homogenisation/RAOBCORE_bias_estimate
1,advanced_homogenisation,RASE_bias_estimate,"(88072698,)",False,False,,advanced_homogenisation/RASE_bias_estimate
2,advanced_homogenisation,RICH_bias_estimate,"(88072698,)",False,False,,advanced_homogenisation/RICH_bias_estimate
3,advanced_homogenisation,RISE_bias_estimate,"(88072698,)",False,False,,advanced_homogenisation/RISE_bias_estimate
4,advanced_homogenisation,humidity_bias_estimate,"(88072698,)",False,False,,advanced_homogenisation/humidity_bias_estimate
5,advanced_homogenisation,index,"(88072698,)",False,True,b'',advanced_homogenisation/index
6,advanced_homogenisation,latitude_displacement,"(88072698,)",False,False,,advanced_homogenisation/latitude_displacement
7,advanced_homogenisation,longitude_displacement,"(88072698,)",False,False,,advanced_homogenisation/longitude_displacement
8,advanced_homogenisation,time_since_launch,"(88072698,)",False,False,,advanced_homogenisation/time_since_launch
9,advanced_homogenisation,true_time,"(88072698,)",False,False,,advanced_homogenisation/true_time
10,advanced_homogenisation,wind_bias_estimate,"(88072698,)",False,False,,advanced_homogenisation/wind_bias_estimate
11,advanced_uncertainty,desroziers_180,"(88072698,)",False,False,,advanced_uncertainty/desroziers_180
12,advanced_uncertainty,desroziers_30,"(88072698,)",False,False,,advanced_uncertainty/desroziers_30
13,advanced_uncertainty,desroziers_60,"(88072698,)",False,False,,advanced_uncertainty/desroziers_60
14,advanced_uncertainty,desroziers_90,"(88072698,)",False,False,,advanced_uncertainty/desroziers_90
15,advanced_uncertainty,index,"(88072698,)",False,True,b'',advanced_uncertainty/index
16,advanced_uncertainty,num_180,"(88072698,)",False,False,,advanced_uncertainty/num_180
17,advanced_uncertainty,num_30,"(88072698,)",False,False,,advanced_uncertainty/num_30
18,advanced_uncertainty,num_60,"(88072698,)",False,False,,advanced_uncertainty/num_60
19,advanced_uncertainty,num_90,"(88072698,)",False,False,,advanced_uncertainty/num_90
145,header_table,string11,"(11,)",False,True,b'',header_table/string11
276,station_configuration,string21,"(20,)",False,True,b'',station_configuration/string21
280,station_configuration,string32,"(20,)",False,True,b'',station_configuration/string32

In [50]:
rdf[np.isin(rdf.path, rdf_old.path)]

,group,variable,len,allnan,allequ,value_if_all_same,path
0,crs,crs,"(1,)",False,True,0,crs/crs
1,crs,crs_len,"(1,)",False,True,0.0,crs/crs_len
2,crs,description,"(1, 80)",False,True,[b'w' b'g' b's' b'8' b'4' b'' b'' b'' b'' b'' ...,crs/description
3,crs,string80,"(80,)",False,True,0.0,crs/string80
4,era5fb,albedo@modsurf,"(115828893,)",False,False,,era5fb/albedo@modsurf
...,...,...,...,...,...,...,...
282,units,units_len,"(154,)",False,True,0.0,units/units_len
283,z_coordinate_type,description,"(2, 80)",False,False,,z_coordinate_type/description
284,z_coordinate_type,string80,"(80,)",False,True,0.0,z_coordinate_type/string80
285,z_coordinate_type,type,"(2,)",False,False,,z_coordinate_type/type
286,z_coordinate_type,z_coordinate_type_len,"(2,)",False,True,0.0,z_coordinate_type/z_coordinate_type_len

In [38]:
add_col = []
for i in rdf_old.group.drop_duplicates():
    #print(i)
    irdf = rdf[rdf.group == i]
    for j in irdf.variable:
        virdf = irdf[irdf.variable == j]
        if len(rdf[np.logical_and(rdf.group == i, rdf.variable ==j)]) > 0:
            display(rdf[np.logical_and(rdf.group == i, rdf.variable ==j)])
            print(i,j)

  group variable   len  allnan  allequ value_if_all_same
0   crs      crs  (1,)   False    True                 0

crs crs

  group variable   len  allnan  allequ value_if_all_same
1   crs  crs_len  (1,)   False    True               0.0

crs crs_len

,group,variable,len,allnan,allequ,value_if_all_same
2,crs,description,"(1, 80)",False,True,[b'w' b'g' b's' b'8' b'4' b'' b'' b'' b'' b'' ...

crs description

  group  variable    len  allnan  allequ value_if_all_same
3   crs  string80  (80,)   False    True               0.0

crs string80

    group        variable           len  allnan  allequ value_if_all_same
4  era5fb  albedo@modsurf  (115828893,)   False   False

era5fb albedo@modsurf

    group       variable           len  allnan  allequ value_if_all_same
5  era5fb  an_depar@body  (115828893,)   False   False

era5fb an_depar@body

,group,variable,len,allnan,allequ,value_if_all_same
6,era5fb,an_depar@surfbody_feedback,"(115828893,)",False,False,

era5fb an_depar@surfbody_feedback

    group          variable           len  allnan  allequ value_if_all_same
7  era5fb  an_sens_obs@body  (115828893,)   False   False

era5fb an_sens_obs@body

    group variable           len  allnan  allequ value_if_all_same
8  era5fb   andate  (115828893,)   False   False

era5fb andate

    group variable           len  allnan  allequ value_if_all_same
9  era5fb   antime  (115828893,)   False   False

era5fb antime

     group       variable           len  allnan  allequ value_if_all_same
10  era5fb  biascorr@body  (115828893,)   False   False

era5fb biascorr@body

     group          variable           len  allnan  allequ value_if_all_same
11  era5fb  biascorr_fg@body  (115828893,)   False   False

era5fb biascorr_fg@body

     group      variable           len  allnan  allequ value_if_all_same
12  era5fb  bufrtype@hdr  (115828893,)   False   False

era5fb bufrtype@hdr

     group variable           len  allnan  allequ value_if_all_same
13  era5fb    class  (115828893,)   False   False

era5fb class

     group      variable           len  allnan  allequ value_if_all_same
14  era5fb  codetype@hdr  (115828893,)   False   False

era5fb codetype@hdr

,group,variable,len,allnan,allequ,value_if_all_same
15,era5fb,collection_identifier@conv,"(115828893,)",False,False,

era5fb collection_identifier@conv

     group  variable           len  allnan  allequ value_if_all_same
16  era5fb  date@hdr  (115828893,)   False   False

era5fb date@hdr

     group           variable           len  allnan  allequ value_if_all_same
17  era5fb  datum_anflag@body  (115828893,)   False   False

era5fb datum_anflag@body

     group           variable           len  allnan  allequ value_if_all_same
18  era5fb  datum_event1@body  (115828893,)   False   False

era5fb datum_event1@body

     group            variable           len  allnan  allequ value_if_all_same
19  era5fb  datum_rdbflag@body  (115828893,)   False   False

era5fb datum_rdbflag@body

,group,variable,len,allnan,allequ,value_if_all_same
20,era5fb,datum_sfc_event@surfbody_feedback,"(115828893,)",False,False,

era5fb datum_sfc_event@surfbody_feedback

     group           variable           len  allnan  allequ value_if_all_same
21  era5fb  datum_status@body  (115828893,)   False   False

era5fb datum_status@body

,group,variable,len,allnan,allequ,value_if_all_same
22,era5fb,datum_status@surfbody_feedback,"(115828893,)",False,False,

era5fb datum_status@surfbody_feedback

     group            variable           len  allnan  allequ value_if_all_same
23  era5fb  eda_spread@errstat  (115828893,)   False   False

era5fb eda_spread@errstat

     group      variable           len  allnan  allequ value_if_all_same
24  era5fb  entryno@body  (115828893,)   False   False

era5fb entryno@body

     group variable             len  allnan  allequ value_if_all_same
25  era5fb   expver  (115828893, 6)   False   False

era5fb expver

     group       variable           len  allnan  allequ value_if_all_same
26  era5fb  fg_depar@body  (115828893,)   False   False

era5fb fg_depar@body

,group,variable,len,allnan,allequ,value_if_all_same
27,era5fb,fg_depar@surfbody_feedback,"(115828893,)",False,False,

era5fb fg_depar@surfbody_feedback

     group          variable           len  allnan  allequ value_if_all_same
28  era5fb  fg_error@errstat  (115828893,)   False   False

era5fb fg_error@errstat

,group,variable,len,allnan,allequ,value_if_all_same
29,era5fb,final_obs_error@errstat,"(115828893,)",False,False,

era5fb final_obs_error@errstat

     group     variable           len  allnan  allequ value_if_all_same
30  era5fb  groupid@hdr  (115828893,)   False   False

era5fb groupid@hdr

     group variable           len  allnan  allequ value_if_all_same
31  era5fb    index  (115828893,)   False    True               b''

era5fb index

     group variable           len  allnan  allequ value_if_all_same
32  era5fb  lat@hdr  (115828893,)   False   False

era5fb lat@hdr

     group variable           len  allnan  allequ value_if_all_same
33  era5fb  lon@hdr  (115828893,)   False   False

era5fb lon@hdr

     group     variable           len  allnan  allequ value_if_all_same
34  era5fb  lsm@modsurf  (115828893,)   False   False

era5fb lsm@modsurf

,group,variable,len,allnan,allequ,value_if_all_same
35,era5fb,lsm@surfbody_feedback,"(115828893,)",True,False,nan

era5fb lsm@surfbody_feedback

     group     variable           len  allnan  allequ value_if_all_same
36  era5fb  numtsl@desc  (115828893,)   False   False

era5fb numtsl@desc

     group           variable           len  allnan  allequ value_if_all_same
37  era5fb  obs_error@errstat  (115828893,)   False   False

era5fb obs_error@errstat

     group     variable           len  allnan  allequ value_if_all_same
38  era5fb  obstype@hdr  (115828893,)   False   False

era5fb obstype@hdr

     group       variable           len  allnan  allequ value_if_all_same
39  era5fb  obsvalue@body  (115828893,)   False   False

era5fb obsvalue@body

     group           variable           len  allnan  allequ value_if_all_same
40  era5fb  orography@modsurf  (115828893,)   False   False

era5fb orography@modsurf

     group          variable           len  allnan  allequ value_if_all_same
41  era5fb  ppcode@conv_body  (115828893,)   False   False

era5fb ppcode@conv_body

     group     variable           len  allnan  allequ value_if_all_same
42  era5fb  qc_pge@body  (115828893,)   False   False

era5fb qc_pge@body

     group           variable           len  allnan  allequ value_if_all_same
43  era5fb  report_event1@hdr  (115828893,)   False   False

era5fb report_event1@hdr

     group            variable           len  allnan  allequ value_if_all_same
44  era5fb  report_rdbflag@hdr  (115828893,)   False   False

era5fb report_rdbflag@hdr

     group           variable           len  allnan  allequ value_if_all_same
45  era5fb  report_status@hdr  (115828893,)   False   False

era5fb report_status@hdr

     group   variable           len  allnan  allequ value_if_all_same
46  era5fb  reportype  (115828893,)   False   False

era5fb reportype

     group        variable           len  allnan  allequ value_if_all_same
47  era5fb  seaice@modsurf  (115828893,)   False   False

era5fb seaice@modsurf

     group    variable           len  allnan  allequ value_if_all_same
48  era5fb  sensor@hdr  (115828893,)   False   False

era5fb sensor@hdr

     group   variable           len  allnan  allequ value_if_all_same
49  era5fb  seqno@hdr  (115828893,)   False   False

era5fb seqno@hdr

,group,variable,len,allnan,allequ,value_if_all_same
50,era5fb,snow_density@surfbody_feedback,"(115828893,)",True,False,nan

era5fb snow_density@surfbody_feedback

     group            variable           len  allnan  allequ value_if_all_same
51  era5fb  snow_depth@modsurf  (115828893,)   False   False

era5fb snow_depth@modsurf

,group,variable,len,allnan,allequ,value_if_all_same
52,era5fb,snow_depth@surfbody_feedback,"(115828893,)",True,False,nan

era5fb snow_depth@surfbody_feedback

     group         variable           len  allnan  allequ value_if_all_same
53  era5fb  sonde_type@conv  (115828893,)   False   False

era5fb sonde_type@conv

     group    variable              len  allnan  allequ value_if_all_same
54  era5fb  source@hdr  (115828893, 10)   False   False

era5fb source@hdr

     group   variable              len  allnan  allequ value_if_all_same
55  era5fb  source_id  (115828893, 10)   False   False

era5fb source_id

     group   variable           len  allnan  allequ value_if_all_same
56  era5fb  stalt@hdr  (115828893,)   False   False

era5fb stalt@hdr

     group    variable             len  allnan  allequ value_if_all_same
57  era5fb  statid@hdr  (115828893, 9)   False   False

era5fb statid@hdr

     group           variable           len  allnan  allequ value_if_all_same
58  era5fb  station_type@conv  (115828893,)   False   False

era5fb station_type@conv

     group variable           len  allnan  allequ value_if_all_same
59  era5fb   stream  (115828893,)   False   False

era5fb stream

     group  variable    len  allnan  allequ value_if_all_same
60  era5fb  string10  (10,)   False    True               b''

era5fb string10

     group variable   len  allnan  allequ value_if_all_same
61  era5fb  string6  (6,)   False    True               b''

era5fb string6

     group variable   len  allnan  allequ value_if_all_same
62  era5fb  string9  (9,)   False    True               b''

era5fb string9

     group     variable           len  allnan  allequ value_if_all_same
63  era5fb  subtype@hdr  (115828893,)   False   False

era5fb subtype@hdr

     group  variable           len  allnan  allequ value_if_all_same
64  era5fb  time@hdr  (115828893,)   False   False

era5fb time@hdr

,group,variable,len,allnan,allequ,value_if_all_same
65,era5fb,timeseries_index@conv,"(115828893,)",False,False,

era5fb timeseries_index@conv

,group,variable,len,allnan,allequ,value_if_all_same
66,era5fb,timeslot@timeslot_index,"(115828893,)",False,False,

era5fb timeslot@timeslot_index

     group      variable           len  allnan  allequ value_if_all_same
67  era5fb  tsfc@modsurf  (115828893,)   False   False

era5fb tsfc@modsurf

     group variable           len  allnan  allequ value_if_all_same
68  era5fb     type  (115828893,)   False   False

era5fb type

,group,variable,len,allnan,allequ,value_if_all_same
69,era5fb,unique_identifier@conv,"(115828893,)",False,False,

era5fb unique_identifier@conv

     group       variable           len  allnan  allequ value_if_all_same
70  era5fb  varbc_ix@body  (115828893,)   False   False

era5fb varbc_ix@body

     group    variable           len  allnan  allequ value_if_all_same
71  era5fb  varno@body  (115828893,)   False   False

era5fb varno@body

,group,variable,len,allnan,allequ,value_if_all_same
72,era5fb,vertco_reference_1@body,"(115828893,)",False,False,

era5fb vertco_reference_1@body

,group,variable,len,allnan,allequ,value_if_all_same
73,era5fb,vertco_reference_2@body,"(115828893,)",False,False,

era5fb vertco_reference_2@body

     group          variable           len  allnan  allequ value_if_all_same
74  era5fb  vertco_type@body  (115828893,)   False   False

era5fb vertco_type@body

,group,variable,len,allnan,allequ,value_if_all_same
75,era5fb,windspeed10m@modsurf,"(115828893,)",False,False,

era5fb windspeed10m@modsurf

           group          variable       len  allnan  allequ value_if_all_same
76  header_table  application_area  (99906,)   False   False

header_table application_area

           group variable       len  allnan  allequ value_if_all_same
77  header_table      crs  (99906,)   False    True       -2147483648

header_table crs

           group          variable       len  allnan  allequ value_if_all_same
78  header_table  duplicate_status  (99906,)   False    True       -2147483648

header_table duplicate_status

           group    variable          len  allnan  allequ value_if_all_same
79  header_table  duplicates  (99906, 70)   False   False

header_table duplicates

,group,variable,len,allnan,allequ,value_if_all_same
80,header_table,events_at_station,"(99906,)",False,False,

header_table events_at_station

,group,variable,len,allnan,allequ,value_if_all_same
81,header_table,height_of_station_above_local_ground,"(99906,)",True,False,nan

header_table height_of_station_above_local_ground

,group,variable,len,allnan,allequ,value_if_all_same
82,header_table,height_of_station_above_sea_level,"(99906,)",True,False,nan

header_table height_of_station_above_sea_level

,group,variable,len,allnan,allequ,value_if_all_same
83,header_table,height_of_station_above_sea_level_accuracy,"(99906,)",True,False,nan

header_table height_of_station_above_sea_level_accuracy

           group variable       len  allnan  allequ value_if_all_same
84  header_table    index  (99906,)   False    True               b''

header_table index

,group,variable,len,allnan,allequ,value_if_all_same
85,header_table,instrument,"(99906, 20)",False,True,[b'n' b'a' b'n' b'' b'' b'' b'' b'' b'' b'' b'...

header_table instrument

           group  variable       len  allnan  allequ value_if_all_same
86  header_table  latitude  (99906,)   False   False

header_table latitude

,group,variable,len,allnan,allequ,value_if_all_same
87,header_table,location_accuracy,"(99906,)",True,False,nan

header_table location_accuracy

           group         variable       len  allnan  allequ value_if_all_same
88  header_table  location_method  (99906,)   False    True       -2147483648

header_table location_method

           group          variable       len  allnan  allequ value_if_all_same
89  header_table  location_quality  (99906,)   False    True       -2147483648

header_table location_quality

           group   variable       len  allnan  allequ value_if_all_same
90  header_table  longitude  (99906,)   False   False

header_table longitude

,group,variable,len,allnan,allequ,value_if_all_same
91,header_table,number_of_pressure_levels,"(99906,)",False,True,-2147483648

header_table number_of_pressure_levels

,group,variable,len,allnan,allequ,value_if_all_same
92,header_table,observing_programme,"(99906,)",False,False,

header_table observing_programme

,group,variable,len,allnan,allequ,value_if_all_same
93,header_table,owner,"(99906, 20)",False,True,[b'n' b'a' b'n' b'' b'' b'' b'' b'' b'' b'' b'...

header_table owner

,group,variable,len,allnan,allequ,value_if_all_same
94,header_table,platform_sub_type,"(99906,)",False,False,

header_table platform_sub_type

           group       variable       len  allnan  allequ value_if_all_same
95  header_table  platform_type  (99906,)   False    True                 0

header_table platform_type

,group,variable,len,allnan,allequ,value_if_all_same
96,header_table,primary_station_id,"(99906, 15)",False,True,[b'0' b'-' b'2' b'0' b'0' b'0' b'1' b'-' b'0' ...

header_table primary_station_id

,group,variable,len,allnan,allequ,value_if_all_same
97,header_table,primary_station_id_scheme,"(99906,)",False,True,-2147483648

header_table primary_station_id_scheme

           group          variable       len  allnan  allequ value_if_all_same
98  header_table  processing_codes  (99906,)   False   False

header_table processing_codes

           group          variable       len  allnan  allequ value_if_all_same
99  header_table  processing_level  (99906,)   False    True       -2147483648

header_table processing_level

,group,variable,len,allnan,allequ,value_if_all_same
100,header_table,product_name,"(99906, 20)",False,True,[b'n' b'a' b'n' b'' b'' b'' b'' b'' b'' b'' b'...

header_table product_name

            group         variable       len  allnan  allequ value_if_all_same
101  header_table  product_version  (99906,)   False    True       -2147483648

header_table product_version

,group,variable,len,allnan,allequ,value_if_all_same
102,header_table,profile_id,"(99906, 20)",False,True,[b'n' b'a' b'n' b'' b'' b'' b'' b'' b'' b'' b'...

header_table profile_id

,group,variable,len,allnan,allequ,value_if_all_same
103,header_table,record_timestamp,"(99906,)",False,False,

header_table record_timestamp

,group,variable,len,allnan,allequ,value_if_all_same
104,header_table,references,"(99906, 20)",False,True,[b'n' b'a' b'n' b'' b'' b'' b'' b'' b'' b'' b'...

header_table references

            group variable       len  allnan  allequ value_if_all_same
105  header_table   region  (99906,)   False    True       -2147483648

header_table region

            group         variable       len  allnan  allequ value_if_all_same
106  header_table  report_duration  (99906,)   False    True       -2147483648

header_table report_duration

            group   variable          len  allnan  allequ value_if_all_same
107  header_table  report_id  (99906, 21)   False   False

header_table report_id

,group,variable,len,allnan,allequ,value_if_all_same
108,header_table,report_meaning_of_timestamp,"(99906,)",False,True,-2147483648

header_table report_meaning_of_timestamp

            group        variable       len  allnan  allequ value_if_all_same
109  header_table  report_quality  (99906,)   False    True       -2147483648

header_table report_quality

,group,variable,len,allnan,allequ,value_if_all_same
110,header_table,report_synoptic_time,"(99906,)",False,True,-9223372036854775808

header_table report_synoptic_time

,group,variable,len,allnan,allequ,value_if_all_same
111,header_table,report_time_accuracy,"(99906,)",True,False,nan

header_table report_time_accuracy

,group,variable,len,allnan,allequ,value_if_all_same
112,header_table,report_time_quality,"(99906,)",False,True,-2147483648

header_table report_time_quality

,group,variable,len,allnan,allequ,value_if_all_same
113,header_table,report_time_reference,"(99906,)",False,True,-2147483648

header_table report_time_reference

,group,variable,len,allnan,allequ,value_if_all_same
114,header_table,report_timestamp,"(99906,)",False,False,

header_table report_timestamp

            group     variable       len  allnan  allequ value_if_all_same
115  header_table  report_type  (99906,)   False    True       -2147483648

header_table report_type

            group         variable       len  allnan  allequ value_if_all_same
116  header_table  sea_level_datum  (99906,)   False    True       -2147483648

header_table sea_level_datum

            group   variable         len  allnan  allequ value_if_all_same
117  header_table  source_id  (99906, 9)   False   False

header_table source_id

,group,variable,len,allnan,allequ,value_if_all_same
118,header_table,source_record_id,"(99906, 20)",False,True,[b'n' b'a' b'n' b'' b'' b'' b'' b'' b'' b'' b'...

header_table source_record_id

            group        variable       len  allnan  allequ value_if_all_same
119  header_table  station_course  (99906,)    True   False               nan

header_table station_course

            group         variable       len  allnan  allequ value_if_all_same
120  header_table  station_heading  (99906,)    True   False               nan

header_table station_heading

,group,variable,len,allnan,allequ,value_if_all_same
121,header_table,station_name,"(99906, 25)",False,True,[b'W' b'I' b'E' b'N' b'/' b'H' b'O' b'H' b'E' ...

header_table station_name

,group,variable,len,allnan,allequ,value_if_all_same
122,header_table,station_record_number,"(99906,)",False,True,-2147483648

header_table station_record_number

            group       variable       len  allnan  allequ value_if_all_same
123  header_table  station_speed  (99906,)    True   False               nan

header_table station_speed

            group      variable       len  allnan  allequ value_if_all_same
124  header_table  station_type  (99906,)   False   False

header_table station_type

            group  variable    len  allnan  allequ value_if_all_same
125  header_table  string15  (15,)   False    True               b''

header_table string15

            group  variable    len  allnan  allequ value_if_all_same
126  header_table  string20  (20,)   False    True               b''

header_table string20

            group  variable    len  allnan  allequ value_if_all_same
127  header_table  string21  (20,)   False    True               b''

header_table string21

            group  variable    len  allnan  allequ value_if_all_same
128  header_table  string25  (20,)   False    True               b''

header_table string25

            group  variable    len  allnan  allequ value_if_all_same
129  header_table  string70  (20,)   False    True               b''

header_table string70

            group variable   len  allnan  allequ value_if_all_same
130  header_table  string9  (9,)   False    True               b''

header_table string9

            group    variable       len  allnan  allequ value_if_all_same
131  header_table  sub_region  (99906,)   False    True       -2147483648

header_table sub_region

,group,variable,len,allnan,allequ,value_if_all_same
132,observations_table,adjustment_id,"(115828893,)",True,False,nan

observations_table adjustment_id

,group,variable,len,allnan,allequ,value_if_all_same
133,observations_table,advanced_assimilation_feedback,"(115828893,)",False,False,

observations_table advanced_assimilation_feedback

,group,variable,len,allnan,allequ,value_if_all_same
134,observations_table,advanced_homogenisation,"(115828893,)",False,True,-2147483648

observations_table advanced_homogenisation

,group,variable,len,allnan,allequ,value_if_all_same
135,observations_table,advanced_qc,"(115828893,)",False,True,-2147483648

observations_table advanced_qc

,group,variable,len,allnan,allequ,value_if_all_same
136,observations_table,advanced_uncertainty,"(115828893,)",False,False,

observations_table advanced_uncertainty

,group,variable,len,allnan,allequ,value_if_all_same
137,observations_table,bbox_max_latitude,"(115828893,)",True,False,nan

observations_table bbox_max_latitude

,group,variable,len,allnan,allequ,value_if_all_same
138,observations_table,bbox_max_longitude,"(115828893,)",True,False,nan

observations_table bbox_max_longitude

,group,variable,len,allnan,allequ,value_if_all_same
139,observations_table,bbox_min_latitude,"(115828893,)",True,False,nan

observations_table bbox_min_latitude

,group,variable,len,allnan,allequ,value_if_all_same
140,observations_table,bbox_min_longitude,"(115828893,)",True,False,nan

observations_table bbox_min_longitude

,group,variable,len,allnan,allequ,value_if_all_same
141,observations_table,code_table,"(115828893,)",False,True,-2147483648

observations_table code_table

,group,variable,len,allnan,allequ,value_if_all_same
142,observations_table,conversion_flag,"(115828893,)",False,False,

observations_table conversion_flag

,group,variable,len,allnan,allequ,value_if_all_same
143,observations_table,conversion_method,"(115828893,)",False,False,

observations_table conversion_method

,group,variable,len,allnan,allequ,value_if_all_same
144,observations_table,crs,"(115828893,)",False,True,-2147483648

observations_table crs

,group,variable,len,allnan,allequ,value_if_all_same
145,observations_table,data_policy_licence,"(115828893,)",False,False,

observations_table data_policy_licence

,group,variable,len,allnan,allequ,value_if_all_same
146,observations_table,date_time,"(115828893,)",False,False,

observations_table date_time

,group,variable,len,allnan,allequ,value_if_all_same
147,observations_table,date_time_meaning,"(115828893,)",False,True,-2147483648

observations_table date_time_meaning

,group,variable,len,allnan,allequ,value_if_all_same
148,observations_table,exposure_of_sensor,"(115828893,)",False,True,-2147483648

observations_table exposure_of_sensor

,group,variable,len,allnan,allequ,value_if_all_same
149,observations_table,index,"(115828893,)",False,True,b''

observations_table index

,group,variable,len,allnan,allequ,value_if_all_same
150,observations_table,latitude,"(115828893,)",False,False,

observations_table latitude

,group,variable,len,allnan,allequ,value_if_all_same
151,observations_table,location_method,"(115828893,)",False,True,-2147483648

observations_table location_method

,group,variable,len,allnan,allequ,value_if_all_same
152,observations_table,location_precision,"(115828893,)",True,False,nan

observations_table location_precision

,group,variable,len,allnan,allequ,value_if_all_same
153,observations_table,longitude,"(115828893,)",False,False,

observations_table longitude

,group,variable,len,allnan,allequ,value_if_all_same
154,observations_table,numerical_precision,"(115828893,)",True,False,nan

observations_table numerical_precision

,group,variable,len,allnan,allequ,value_if_all_same
155,observations_table,observation_duration,"(115828893,)",False,True,0

observations_table observation_duration

,group,variable,len,allnan,allequ,value_if_all_same
156,observations_table,observation_height_above_station_surface,"(115828893,)",True,False,nan

observations_table observation_height_above_station_surface

,group,variable,len,allnan,allequ,value_if_all_same
157,observations_table,observation_id,"(115828893, 11)",False,False,

observations_table observation_id

,group,variable,len,allnan,allequ,value_if_all_same
158,observations_table,observation_value,"(115828893,)",False,False,

observations_table observation_value

,group,variable,len,allnan,allequ,value_if_all_same
159,observations_table,observed_variable,"(115828893,)",False,False,

observations_table observed_variable

,group,variable,len,allnan,allequ,value_if_all_same
160,observations_table,original_code_table,"(115828893,)",False,True,-2147483648

observations_table original_code_table

,group,variable,len,allnan,allequ,value_if_all_same
161,observations_table,original_precision,"(115828893,)",True,False,nan

observations_table original_precision

,group,variable,len,allnan,allequ,value_if_all_same
162,observations_table,original_units,"(115828893,)",False,True,-2147483648

observations_table original_units

,group,variable,len,allnan,allequ,value_if_all_same
163,observations_table,original_value,"(115828893,)",True,False,nan

observations_table original_value

,group,variable,len,allnan,allequ,value_if_all_same
164,observations_table,processing_level,"(115828893,)",False,True,-2147483648

observations_table processing_level

,group,variable,len,allnan,allequ,value_if_all_same
165,observations_table,quality_flag,"(115828893,)",False,True,-2147483648

observations_table quality_flag

,group,variable,len,allnan,allequ,value_if_all_same
166,observations_table,report_id,"(115828893, 21)",False,False,

observations_table report_id

,group,variable,len,allnan,allequ,value_if_all_same
167,observations_table,secondary_value,"(115828893,)",False,True,-2147483648

observations_table secondary_value

,group,variable,len,allnan,allequ,value_if_all_same
168,observations_table,secondary_variable,"(115828893,)",False,True,-2147483648

observations_table secondary_variable

,group,variable,len,allnan,allequ,value_if_all_same
169,observations_table,sensor_automation_status,"(115828893,)",False,True,-2147483648

observations_table sensor_automation_status

,group,variable,len,allnan,allequ,value_if_all_same
170,observations_table,sensor_id,"(115828893, 4)",False,False,

observations_table sensor_id

,group,variable,len,allnan,allequ,value_if_all_same
171,observations_table,source_id,"(115828893, 9)",False,False,

observations_table source_id

,group,variable,len,allnan,allequ,value_if_all_same
172,observations_table,spatial_representativeness,"(115828893,)",False,True,-2147483648

observations_table spatial_representativeness

                  group  variable    len  allnan  allequ value_if_all_same
173  observations_table  string11  (11,)   False    True               b''

observations_table string11

                  group  variable    len  allnan  allequ value_if_all_same
174  observations_table  string21  (20,)   False    True               b''

observations_table string21

                  group variable   len  allnan  allequ value_if_all_same
175  observations_table  string4  (4,)   False    True               b''

observations_table string4

                  group variable   len  allnan  allequ value_if_all_same
176  observations_table  string9  (9,)   False    True               b''

observations_table string9

,group,variable,len,allnan,allequ,value_if_all_same
177,observations_table,traceability,"(115828893,)",False,True,-2147483648

observations_table traceability

,group,variable,len,allnan,allequ,value_if_all_same
178,observations_table,units,"(115828893,)",False,False,

observations_table units

,group,variable,len,allnan,allequ,value_if_all_same
179,observations_table,value_significance,"(115828893,)",False,True,12

observations_table value_significance

,group,variable,len,allnan,allequ,value_if_all_same
180,observations_table,z_coordinate,"(115828893,)",False,False,

observations_table z_coordinate

,group,variable,len,allnan,allequ,value_if_all_same
181,observations_table,z_coordinate_method,"(115828893,)",False,True,-2147483648

observations_table z_coordinate_method

,group,variable,len,allnan,allequ,value_if_all_same
182,observations_table,z_coordinate_type,"(115828893,)",False,False,

observations_table z_coordinate_type

,group,variable,len,allnan,allequ,value_if_all_same
183,observed_variable,description,"(142, 80)",False,False,

observed_variable description

                 group variable        len  allnan  allequ value_if_all_same
184  observed_variable   domain  (142, 80)   False   False

observed_variable domain

                 group variable        len  allnan  allequ value_if_all_same
185  observed_variable     name  (142, 80)   False   False

observed_variable name

,group,variable,len,allnan,allequ,value_if_all_same
186,observed_variable,observed_variable_len,"(142,)",False,True,0.0

observed_variable observed_variable_len

,group,variable,len,allnan,allequ,value_if_all_same
187,observed_variable,parameter_group,"(142, 80)",False,False,

observed_variable parameter_group

                 group  variable    len  allnan  allequ value_if_all_same
188  observed_variable  string80  (80,)   False    True               0.0

observed_variable string80

,group,variable,len,allnan,allequ,value_if_all_same
189,observed_variable,sub_domain,"(142, 80)",False,False,

observed_variable sub_domain

                 group variable        len  allnan  allequ value_if_all_same
190  observed_variable    units  (142, 80)   False   False

observed_variable units

                 group  variable        len  allnan  allequ value_if_all_same
191  observed_variable  variable  (142, 80)   False   False

observed_variable variable

             group variable       len  allnan  allequ value_if_all_same
192  recordindices        0  (99907,)   False   False

recordindices 0

             group variable       len  allnan  allequ value_if_all_same
193  recordindices      106  (99907,)   False   False

recordindices 106

             group variable       len  allnan  allequ value_if_all_same
194  recordindices      107  (99907,)   False   False

recordindices 107

             group variable       len  allnan  allequ value_if_all_same
195  recordindices      117  (99907,)   False   False

recordindices 117

             group variable       len  allnan  allequ value_if_all_same
196  recordindices      126  (99907,)   False   False

recordindices 126

             group variable       len  allnan  allequ value_if_all_same
197  recordindices      137  (99907,)   False   False

recordindices 137

             group variable       len  allnan  allequ value_if_all_same
198  recordindices      138  (99907,)   False   False

recordindices 138

             group variable       len  allnan  allequ value_if_all_same
199  recordindices      139  (99907,)   False   False

recordindices 139

             group variable       len  allnan  allequ value_if_all_same
200  recordindices      140  (99907,)   False   False

recordindices 140

             group variable       len  allnan  allequ value_if_all_same
201  recordindices       34  (99907,)   False   False

recordindices 34

             group variable       len  allnan  allequ value_if_all_same
202  recordindices       39  (99907,)   False   False

recordindices 39

             group variable       len  allnan  allequ value_if_all_same
203  recordindices    index  (99907,)   False    True               b''

recordindices index

,group,variable,len,allnan,allequ,value_if_all_same
204,recordindices,recordtimestamp,"(99906,)",False,False,

recordindices recordtimestamp

,group,variable,len,allnan,allequ,value_if_all_same
205,sensor_configuration,calibration_date,"(3295,)",True,False,nan

sensor_configuration calibration_date

,group,variable,len,allnan,allequ,value_if_all_same
206,sensor_configuration,calibration_status,"(3295,)",True,False,nan

sensor_configuration calibration_status

,group,variable,len,allnan,allequ,value_if_all_same
207,sensor_configuration,comments,"(3295, 200)",False,False,

sensor_configuration comments

                    group  variable      len  allnan  allequ value_if_all_same
208  sensor_configuration  date_end  (3295,)    True   False               nan

sensor_configuration date_end

,group,variable,len,allnan,allequ,value_if_all_same
209,sensor_configuration,date_start,"(3295,)",True,False,nan

sensor_configuration date_start

,group,variable,len,allnan,allequ,value_if_all_same
210,sensor_configuration,observing_method,"(3295,)",True,False,nan

sensor_configuration observing_method

,group,variable,len,allnan,allequ,value_if_all_same
211,sensor_configuration,optional_data,"(3295,)",True,False,nan

sensor_configuration optional_data

,group,variable,len,allnan,allequ,value_if_all_same
212,sensor_configuration,sampling_strategy,"(3295,)",True,False,nan

sensor_configuration sampling_strategy

,group,variable,len,allnan,allequ,value_if_all_same
213,sensor_configuration,sensor_configuration_len,"(3295,)",False,True,0.0

sensor_configuration sensor_configuration_len

,group,variable,len,allnan,allequ,value_if_all_same
214,sensor_configuration,sensor_id,"(3295, 4)",False,False,

sensor_configuration sensor_id

                    group   variable     len  allnan  allequ value_if_all_same
215  sensor_configuration  string200  (200,)   False    True               0.0

sensor_configuration string200

                    group variable   len  allnan  allequ value_if_all_same
216  sensor_configuration  string4  (4,)   False    True               0.0

sensor_configuration string4

,group,variable,len,allnan,allequ,value_if_all_same
217,source_configuration,source_file,"(99906, 70)",False,False,

source_configuration source_file

                    group  variable    len  allnan  allequ value_if_all_same
218  source_configuration  string70  (70,)   False    True               0.0

source_configuration string70

,group,variable,len,allnan,allequ,value_if_all_same
219,station_configuration,alternative_name,"(99906, 3)",False,True,[b'n' b'a' b'n']

station_configuration alternative_name

,group,variable,len,allnan,allequ,value_if_all_same
220,station_configuration,bbox_max_latitude,"(99906,)",True,False,nan

station_configuration bbox_max_latitude

,group,variable,len,allnan,allequ,value_if_all_same
221,station_configuration,bbox_max_longitude,"(99906,)",True,False,nan

station_configuration bbox_max_longitude

,group,variable,len,allnan,allequ,value_if_all_same
222,station_configuration,bbox_min_latitude,"(99906,)",True,False,nan

station_configuration bbox_min_latitude

,group,variable,len,allnan,allequ,value_if_all_same
223,station_configuration,bbox_min_longitude,"(99906,)",True,False,nan

station_configuration bbox_min_longitude

,group,variable,len,allnan,allequ,value_if_all_same
224,station_configuration,city,"(99906, 22)",False,True,[b'S' b'c' b'h' b'w' b'e' b'c' b'h' b'a' b't' ...

station_configuration city

,group,variable,len,allnan,allequ,value_if_all_same
225,station_configuration,comment,"(99906, 3)",False,True,[b'n' b'a' b'n']

station_configuration comment

,group,variable,len,allnan,allequ,value_if_all_same
226,station_configuration,contact,"(99906, 3)",False,True,[b'n' b'a' b'n']

station_configuration contact

,group,variable,len,allnan,allequ,value_if_all_same
227,station_configuration,end_date,"(99906, 8)",False,True,[b'2' b'0' b'2' b'1' b'1' b'2' b'3' b'1']

station_configuration end_date

,group,variable,len,allnan,allequ,value_if_all_same
228,station_configuration,index,"(99906,)",False,True,b''

station_configuration index

,group,variable,len,allnan,allequ,value_if_all_same
229,station_configuration,latitude,"(99906,)",False,False,

station_configuration latitude

,group,variable,len,allnan,allequ,value_if_all_same
230,station_configuration,local_gravity,"(99906, 3)",False,True,[b'n' b'a' b'n']

station_configuration local_gravity

,group,variable,len,allnan,allequ,value_if_all_same
231,station_configuration,longitude,"(99906,)",False,False,

station_configuration longitude

,group,variable,len,allnan,allequ,value_if_all_same
232,station_configuration,measuring_system_id,"(99906, 3)",False,True,[b'n' b'a' b'n']

station_configuration measuring_system_id

,group,variable,len,allnan,allequ,value_if_all_same
233,station_configuration,measuring_system_model,"(99906, 3)",False,True,[b'n' b'a' b'n']

station_configuration measuring_system_model

,group,variable,len,allnan,allequ,value_if_all_same
234,station_configuration,metadata_contact,"(99906, 12)",False,True,[b'L' b'.' b'H' b'a' b'i' b'm' b'b' b'e' b'r' ...

station_configuration metadata_contact

,group,variable,len,allnan,allequ,value_if_all_same
235,station_configuration,metadata_contact_role,"(99906,)",False,True,0

station_configuration metadata_contact_role

,group,variable,len,allnan,allequ,value_if_all_same
236,station_configuration,observed_variables,"(99906, 34)",False,True,"[b'1' b'0' b'6' b',' b'1' b'0' b'7' b',' b'1' ..."

station_configuration observed_variables

,group,variable,len,allnan,allequ,value_if_all_same
237,station_configuration,observing_frequency,"(99906,)",True,False,nan

station_configuration observing_frequency

,group,variable,len,allnan,allequ,value_if_all_same
238,station_configuration,operating_institute,"(99906, 3)",False,True,[b'N' b'M' b'S']

station_configuration operating_institute

,group,variable,len,allnan,allequ,value_if_all_same
239,station_configuration,operating_territory,"(99906, 4)",False,True,[b'1' b'2' b'.' b'0']

station_configuration operating_territory

,group,variable,len,allnan,allequ,value_if_all_same
240,station_configuration,optional_data,"(99906, 3)",False,True,[b'n' b'a' b'n']

station_configuration optional_data

,group,variable,len,allnan,allequ,value_if_all_same
241,station_configuration,platform_sub_type,"(99906,)",False,True,63

station_configuration platform_sub_type

,group,variable,len,allnan,allequ,value_if_all_same
242,station_configuration,platform_type,"(99906,)",False,True,0

station_configuration platform_type

,group,variable,len,allnan,allequ,value_if_all_same
243,station_configuration,primary_id,"(99906, 15)",False,True,[b'0' b'-' b'2' b'0' b'0' b'0' b'1' b'-' b'0' ...

station_configuration primary_id

,group,variable,len,allnan,allequ,value_if_all_same
244,station_configuration,primary_id_scheme,"(99906, 1)",False,True,[b'0']

station_configuration primary_id_scheme

,group,variable,len,allnan,allequ,value_if_all_same
245,station_configuration,reporting_time,"(99906,)",True,False,nan

station_configuration reporting_time

,group,variable,len,allnan,allequ,value_if_all_same
246,station_configuration,role,"(99906, 3)",False,True,[b'n' b'a' b'n']

station_configuration role

,group,variable,len,allnan,allequ,value_if_all_same
247,station_configuration,secondary_id,"(99906, 83)",False,True,"[b'1' b'1' b'0' b'3' b'0' b',' b'1' b'1' b'0' ..."

station_configuration secondary_id

,group,variable,len,allnan,allequ,value_if_all_same
248,station_configuration,secondary_id_scheme,"(99906,)",False,True,3

station_configuration secondary_id_scheme

,group,variable,len,allnan,allequ,value_if_all_same
249,station_configuration,start_date,"(99906, 8)",False,True,[b'1' b'9' b'1' b'0' b'0' b'1' b'0' b'6']

station_configuration start_date

,group,variable,len,allnan,allequ,value_if_all_same
250,station_configuration,station_abbreviation,"(99906, 3)",False,True,[b'n' b'a' b'n']

station_configuration station_abbreviation

,group,variable,len,allnan,allequ,value_if_all_same
251,station_configuration,station_automation,"(99906,)",True,False,nan

station_configuration station_automation

,group,variable,len,allnan,allequ,value_if_all_same
252,station_configuration,station_crs,"(99906,)",False,True,0

station_configuration station_crs

,group,variable,len,allnan,allequ,value_if_all_same
253,station_configuration,station_name,"(99906, 25)",False,True,[b'W' b'I' b'E' b'N' b'/' b'H' b'O' b'H' b'E' ...

station_configuration station_name

,group,variable,len,allnan,allequ,value_if_all_same
254,station_configuration,station_type,"(99906,)",False,True,1

station_configuration station_type

                     group variable   len  allnan  allequ value_if_all_same
255  station_configuration  string1  (1,)   False    True               b''

station_configuration string1

                     group  variable    len  allnan  allequ value_if_all_same
256  station_configuration  string12  (12,)   False    True               b''

station_configuration string12

                     group  variable    len  allnan  allequ value_if_all_same
257  station_configuration  string15  (15,)   False    True               b''

station_configuration string15

                     group  variable    len  allnan  allequ value_if_all_same
258  station_configuration  string22  (20,)   False    True               b''

station_configuration string22

                     group  variable    len  allnan  allequ value_if_all_same
259  station_configuration  string25  (20,)   False    True               b''

station_configuration string25

                     group variable   len  allnan  allequ value_if_all_same
260  station_configuration  string3  (3,)   False    True               b''

station_configuration string3

                     group  variable    len  allnan  allequ value_if_all_same
261  station_configuration  string34  (20,)   False    True               b''

station_configuration string34

                     group variable   len  allnan  allequ value_if_all_same
262  station_configuration  string4  (4,)   False    True               b''

station_configuration string4

                     group variable   len  allnan  allequ value_if_all_same
263  station_configuration  string8  (8,)   False    True               b''

station_configuration string8

                     group  variable    len  allnan  allequ value_if_all_same
264  station_configuration  string83  (20,)   False    True               b''

station_configuration string83

,group,variable,len,allnan,allequ,value_if_all_same
265,station_configuration,telecommunication_method,"(99906,)",True,False,nan

station_configuration telecommunication_method

,group,variable,len,allnan,allequ,value_if_all_same
266,station_configuration_codes,abbreviation,"(52, 80)",False,False,

station_configuration_codes abbreviation

,group,variable,len,allnan,allequ,value_if_all_same
267,station_configuration_codes,code_value,"(52, 80)",False,False,

station_configuration_codes code_value

,group,variable,len,allnan,allequ,value_if_all_same
268,station_configuration_codes,description,"(52, 80)",False,False,

station_configuration_codes description

,group,variable,len,allnan,allequ,value_if_all_same
269,station_configuration_codes,field_id,"(52, 80)",False,False,

station_configuration_codes field_id

,group,variable,len,allnan,allequ,value_if_all_same
270,station_configuration_codes,field_name,"(52, 80)",False,False,

station_configuration_codes field_name

,group,variable,len,allnan,allequ,value_if_all_same
271,station_configuration_codes,station_configuration_codes_len,"(52,)",False,True,0.0

station_configuration_codes station_configuration_codes_len

,group,variable,len,allnan,allequ,value_if_all_same
272,station_configuration_codes,string80,"(80,)",False,True,0.0

station_configuration_codes string80

            group     variable      len  allnan  allequ value_if_all_same
273  station_type  description  (2, 80)   False   False

station_type description

            group          variable   len  allnan  allequ value_if_all_same
274  station_type  station_type_len  (2,)   False    True               0.0

station_type station_type_len

            group  variable    len  allnan  allequ value_if_all_same
275  station_type  string80  (80,)   False    True               0.0

station_type string80

            group variable   len  allnan  allequ value_if_all_same
276  station_type     type  (2,)   False   False

station_type type

     group      variable        len  allnan  allequ value_if_all_same
277  units  abbreviation  (154, 80)   False   False

units abbreviation

     group    variable        len  allnan  allequ value_if_all_same
278  units  base_units  (154, 80)   False   False

units base_units

     group variable        len  allnan  allequ value_if_all_same
279  units     name  (154, 80)   False   False

units name

     group  variable    len  allnan  allequ value_if_all_same
280  units  string80  (80,)   False    True               0.0

units string80

     group variable        len  allnan  allequ value_if_all_same
281  units    units  (154, 80)   False   False

units units

     group   variable     len  allnan  allequ value_if_all_same
282  units  units_len  (154,)   False    True               0.0

units units_len

                 group     variable      len  allnan  allequ value_if_all_same
283  z_coordinate_type  description  (2, 80)   False   False

z_coordinate_type description

                 group  variable    len  allnan  allequ value_if_all_same
284  z_coordinate_type  string80  (80,)   False    True               0.0

z_coordinate_type string80

                 group variable   len  allnan  allequ value_if_all_same
285  z_coordinate_type     type  (2,)   False   False

z_coordinate_type type

,group,variable,len,allnan,allequ,value_if_all_same
286,z_coordinate_type,z_coordinate_type_len,"(2,)",False,True,0.0

z_coordinate_type z_coordinate_type_len

In [26]:
rdf

,group,variable,len,allnan,allequ,value_if_all_same
0,crs,crs,"(1,)",False,True,0
1,crs,crs_len,"(1,)",False,True,0.0
2,crs,description,"(1, 80)",False,True,[b'w' b'g' b's' b'8' b'4' b'' b'' b'' b'' b'' ...
3,crs,string80,"(80,)",False,True,0.0
4,era5fb,albedo@modsurf,"(115828893,)",False,False,
...,...,...,...,...,...,...
282,units,units_len,"(154,)",False,True,0.0
283,z_coordinate_type,description,"(2, 80)",False,False,
284,z_coordinate_type,string80,"(80,)",False,True,0.0
285,z_coordinate_type,type,"(2,)",False,False,
286,z_coordinate_type,z_coordinate_type_len,"(2,)",False,True,0.0

In [6]:
sys.path.append(os.getcwd()+'/../cds-backend/code/')
import cds_eua4 as eua

In [7]:
def request(rqdict):
    data = eua.vm_request_wrapper(rqdict, overwrite=True, vm_url='http://srvx1.img.univie.ac.at:8007')
    
    return data

In [31]:
var = ['air_temperature', 'relative_humidity', 'eastward_wind_speed']
opt = ''
for i in var:
    rd={
        'variable': i,
        'statid': '11035',
        # 'optional': opt,
        'date': '20191230-20191231',
    } 
    display(request(rd).to_dataframe())

,lat,lon,obs,plev,report_id,station_id,ta,time
0,48.248951,16.356859,0,560.0,100000000116164,WIEN/HOHE WARTE (11035-1),227.250000,2019-12-30 11:32:22
1,48.248951,16.356859,0,570.0,100000000116164,WIEN/HOHE WARTE (11035-1),227.559998,2019-12-30 11:32:22
2,48.248951,16.356859,0,580.0,100000000116164,WIEN/HOHE WARTE (11035-1),227.610001,2019-12-30 11:32:22
3,48.248951,16.356859,0,590.0,100000000116164,WIEN/HOHE WARTE (11035-1),227.710007,2019-12-30 11:32:22
4,48.248951,16.356859,0,600.0,100000000116164,WIEN/HOHE WARTE (11035-1),227.289993,2019-12-30 11:32:22
...,...,...,...,...,...,...,...,...
5667,48.248951,16.357180,0,93430.0,100000000116167,WIEN/HOHE WARTE (11035-1),272.959991,2019-12-31 23:41:21
5668,48.248951,16.357180,0,97960.0,100000000116167,WIEN/HOHE WARTE (11035-1),275.779999,2019-12-31 23:41:21
5669,48.248951,16.357180,0,100000.0,100000000116167,WIEN/HOHE WARTE (11035-1),277.309998,2019-12-31 23:41:21
5670,48.248951,16.357180,0,100440.0,100000000116167,WIEN/HOHE WARTE (11035-1),277.570007,2019-12-31 23:41:21
5671,48.248951,16.357180,0,100980.0,100000000116167,WIEN/HOHE WARTE (11035-1),277.700012,2019-12-31 23:41:21

,hur,lat,lon,obs,plev,report_id,station_id,time
0,0.010622,48.248951,16.356859,0,560.0,100000000116164,WIEN/HOHE WARTE (11035-1),2019-12-30 11:32:22
1,0.010620,48.248951,16.356859,0,570.0,100000000116164,WIEN/HOHE WARTE (11035-1),2019-12-30 11:32:22
2,0.010630,48.248951,16.356859,0,580.0,100000000116164,WIEN/HOHE WARTE (11035-1),2019-12-30 11:32:22
3,0.010616,48.248951,16.356859,0,590.0,100000000116164,WIEN/HOHE WARTE (11035-1),2019-12-30 11:32:22
4,0.010610,48.248951,16.356859,0,600.0,100000000116164,WIEN/HOHE WARTE (11035-1),2019-12-30 11:32:22
...,...,...,...,...,...,...,...,...
5666,0.761943,48.248951,16.357180,0,93430.0,100000000116167,WIEN/HOHE WARTE (11035-1),2019-12-31 23:41:21
5667,0.679380,48.248951,16.357180,0,97960.0,100000000116167,WIEN/HOHE WARTE (11035-1),2019-12-31 23:41:21
5668,0.621206,48.248951,16.357180,0,100000.0,100000000116167,WIEN/HOHE WARTE (11035-1),2019-12-31 23:41:21
5669,0.616800,48.248951,16.357180,0,100440.0,100000000116167,WIEN/HOHE WARTE (11035-1),2019-12-31 23:41:21
5670,0.614387,48.248951,16.357180,0,100980.0,100000000116167,WIEN/HOHE WARTE (11035-1),2019-12-31 23:41:21

,lat,lon,obs,plev,report_id,station_id,time,ua
0,48.248951,16.356859,0,560.0,100000000116164,WIEN/HOHE WARTE (11035-1),2019-12-30 11:32:22,72.345924
1,48.248951,16.356859,0,570.0,100000000116164,WIEN/HOHE WARTE (11035-1),2019-12-30 11:32:22,76.125641
2,48.248951,16.356859,0,580.0,100000000116164,WIEN/HOHE WARTE (11035-1),2019-12-30 11:32:22,75.094482
3,48.248951,16.356859,0,590.0,100000000116164,WIEN/HOHE WARTE (11035-1),2019-12-30 11:32:22,72.675148
4,48.248951,16.356859,0,600.0,100000000116164,WIEN/HOHE WARTE (11035-1),2019-12-30 11:32:22,72.481094
...,...,...,...,...,...,...,...,...
5667,48.248951,16.357180,0,93430.0,100000000116167,WIEN/HOHE WARTE (11035-1),2019-12-31 23:41:21,6.128872
5668,48.248951,16.357180,0,97960.0,100000000116167,WIEN/HOHE WARTE (11035-1),2019-12-31 23:41:21,11.894828
5669,48.248951,16.357180,0,100000.0,100000000116167,WIEN/HOHE WARTE (11035-1),2019-12-31 23:41:21,6.920714
5670,48.248951,16.357180,0,100440.0,100000000116167,WIEN/HOHE WARTE (11035-1),2019-12-31 23:41:21,4.886402
5671,48.248951,16.357180,0,100980.0,100000000116167,WIEN/HOHE WARTE (11035-1),2019-12-31 23:41:21,0.176590

In [8]:
var = ['air_temperature']
opt = ''
for i in var:
    rd={
        'variable': i,
        'statid': '11035',
        # 'optional': opt,
        # 'date': '20191230-20191231',
    } 
    display(request(rd).to_dataframe())

,lat,lon,obs,plev,report_id,station_id,ta,time
0,48.250000,16.370001,0,4300.0,800000000000871,WIEN/HOHE WARTE (11035-1),220.750000,1925-01-24 09:22:00
1,48.250000,16.370001,0,4400.0,800000000000871,WIEN/HOHE WARTE (11035-1),220.550003,1925-01-24 09:22:00
2,48.250000,16.370001,0,5300.0,800000000000871,WIEN/HOHE WARTE (11035-1),216.250000,1925-01-24 09:22:00
3,48.250000,16.370001,0,9200.0,800000000000871,WIEN/HOHE WARTE (11035-1),215.850006,1925-01-24 09:22:00
4,48.250000,16.370001,0,10300.0,800000000000871,WIEN/HOHE WARTE (11035-1),220.050003,1925-01-24 09:22:00
...,...,...,...,...,...,...,...,...
12372040,48.248871,16.357590,0,99440.0,100000000118586,WIEN/HOHE WARTE (11035-1),279.660004,2022-12-31 11:30:23
12372041,48.248871,16.357590,0,99470.0,100000000118586,WIEN/HOHE WARTE (11035-1),279.799988,2022-12-31 11:30:23
12372042,48.248871,16.357590,0,99530.0,100000000118586,WIEN/HOHE WARTE (11035-1),279.920013,2022-12-31 11:30:23
12372043,48.248871,16.357590,0,99540.0,100000000118586,WIEN/HOHE WARTE (11035-1),280.049988,2022-12-31 11:30:23
12372044,48.248871,16.357590,0,99900.0,100000000118586,WIEN/HOHE WARTE (11035-1),280.350006,2022-12-31 11:30:23

In [9]:
rd={
    'variable': 'air_temperature',
    'statid': '11035',
    'year': '2010',
    'month': '01',
    'day':'01',
} 
display(request(rd).to_dataframe())

,lat,lon,obs,plev,report_id,station_id,ta,time
0,48.25,16.370001,0,640.0,100000000096234,WIEN/HOHE WARTE (11035-1),224.500000,2010-01-01 00:00:00
1,48.25,16.370001,0,700.0,100000000096234,WIEN/HOHE WARTE (11035-1),223.300003,2010-01-01 00:00:00
2,48.25,16.370001,0,790.0,100000000096234,WIEN/HOHE WARTE (11035-1),224.500000,2010-01-01 00:00:00
3,48.25,16.370001,0,880.0,100000000096234,WIEN/HOHE WARTE (11035-1),220.500000,2010-01-01 00:00:00
4,48.25,16.370001,0,1000.0,100000000096234,WIEN/HOHE WARTE (11035-1),224.300003,2010-01-01 00:00:00
...,...,...,...,...,...,...,...,...
115,48.25,16.370001,0,94600.0,100000000096237,WIEN/HOHE WARTE (11035-1),279.799988,2010-01-01 12:00:00
116,48.25,16.370001,0,95300.0,100000000096237,WIEN/HOHE WARTE (11035-1),279.799988,2010-01-01 12:00:00
117,48.25,16.370001,0,95400.0,100000000096237,WIEN/HOHE WARTE (11035-1),279.000000,2010-01-01 12:00:00
118,48.25,16.370001,0,95800.0,100000000096237,WIEN/HOHE WARTE (11035-1),278.399994,2010-01-01 12:00:00
119,48.25,16.370001,0,96700.0,100000000096237,WIEN/HOHE WARTE (11035-1),279.399994,2010-01-01 12:00:00